# ex03-Retrieving Data with SELECT

When working with databases and SQL, the most common task is to request data from one or more tables, which returns this data in the form of a result table. These result tables are called result-sets. The ***SELECT*** statement accomplishes this. In most applications, ***SELECT*** is the most commonly used data query language (DQL) command. Moreover, the ***SELECT*** can do far more than simply retrieve and display data and I will show you in the following sections.

***SELECT Syntax***

- *SELECT column1, column2, columnN FROM table_name;*

Here, column1, column2... are the fields (or columns) of a table (table_name).

However, if you want query all records, just use:
- SELECT * FROM table_name;

In [ ]:
%load_ext sql

### 1. Connet to the given database of demo.db3

In [ ]:
%sql sqlite:///data/demo.db3

If you do not remember the tables in the demo data, you can always use the follow command to query. Here we select the table of watershed_yearly as an example.

In [ ]:
%sql SELECT name FROM sqlite_master WHERE type='table'

### 2. Retrieving all data

As we alreay know, the most common SQL operation is a SELECT statement, which pulls data from a table and then displays the results. Letâ€™s write our first SQL statement.

In [ ]:
%sql SELECT * From watershed_yearly

### 3. Retrieving data from specific columns

In many cases, it is not necessary to pull all columns in a SELECT statement. You can also pick and choose only the columns you are interested in. The following query will only pull the ***YR***, ***PREC_mm*** and ***PET_mm*** columns:

In [ ]:
%sql SELECT YR, PREC_mm, PET_mm From watershed_yearly

### 4. Do some calculations in SELECT Statements

:) The SELECT statement can do far more than simply select columns. 

Sometimes, we are also intersted in the relationship between columns. This can be done with expressions in SELECT Statements. For example, I'd like to see the difference between ***PREC_mm*** and ***PET_mm*** columns (using the minus operator **-**). You can also try other operators such as +, *, / or %.

In [ ]:
%sql SELECT YR, PREC_mm, PET_mm, PET_mm-PREC_mm From watershed_yearly

It is amazing, is'nt it? However, the exmpression is presented as a new column name. It is not that beautiful.
***It is quite easy for us to give it a new name using an AS statement (this is known as an alias).***

In [ ]:
%sql SELECT YR, PREC_mm, PET_mm, PET_mm-PREC_mm as PED_mm From watershed_yearly

Besides giving names to expressions using aliases, aliases can also be used to rename an existing column within the query. For example, we rename ***PREC_mm*** to ***Precipitation_mm***.

***However, keep in mind that such an operatation does not affect the real data or change the name in the table.It only change the way you see it on your screen.*** You can always try SELECT * From watershed_yearly to see the truth.

In [ ]:
%sql SELECT YR, PREC_mm as Precipitation_mm, PET_mm, PET_mm-PREC_mm as PED_mm From watershed_yearly

# <font color="red">Click [here](ex04-Constrain%20the%20Number%20of%20Rows%20Returned%20by%20a%20SELECT%20Query.ipynb) to continue to the next notebook</font>